{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"So we have more outrage on the news at the levels of boozing that is going on, people are getting spannered and causing trouble in town centers the length and breadth of this fair land, children dropping dead in their thousands from cognac overdoses, old men are running riot, high on alcopop sugar rushes.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It’s all a terrible outrage I admit, clearly something must be done and the solution is to ban boozing, and if you can’t do that you should make to so hard to buy that only Lords, MP’s and Russian Oligarchs can afford to get their grimy mits on a vat of sauce once in a while.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Only no, that’s frankly a blisteringly stupid idea. It’s clearly not just the availability of cheap booze that turns people into vomiting morons. Why we just have to cast an eye at wonderful mainland Europe to see that (clearly, stop looking once you get past Germany into eastern Europe…They like fun juice even more than we do judging by the number of Polish sounding people I see sipping cans, of Okocim/Lech/Tyskie/Zywiec/other unpronounceable super strong beverage, with fine communist zeal at 8 in the morning by my local bus stop).\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Sure we should do something to prevent the streets being awash with drunken morons at the end of the night whilst I wend my way home from a few civilised pints of gin at my local inn. However making all booze unaffordable will clearly effect me as well as yob X so that won’t do, it won’t do at all. No we need another plan. Somewhat strangely I think I’m just the man to craft said plan!\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"First we should ban anyone under 25 from boozing in public, sure let them get hammered on meths at home or in a local part away from prying eyes, I don’t really care if they batter their livers into submission before they make it to 18 as long as they are decent enough to do it away from view.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Secondly anyone caught fighting, unconscious, vomiting or singing annoyingly loud ditties in the street will get a stern warning from the army of lone vigilantes we will recruit, commit a second offense and you will immediately be killed, liquidised and used to fertilise cider orchards.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Thirdly ban anything from Belgium from being sold anywhere on earth. Why you ask, well a) Belgium is horrible and generally thinking about the place makes me angry so they should be made to suffer at any opportunity, b) I pretty much blame Stella Artois for most of the social ills we are under the yoke of at the moment.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Of course, I don’t really have an opinion about wither people booze too much at all and my policy is clearly preposterous and probably unworkable, I am however sick and bloody tired of stupid news articles moaning on and on about this problem without ever offering a sensible solution other than making is so expensive I’ll have to revert to drinking diamond white (which is just what everyone else will do and thus just exacerbate the situation, rather than solve it). All they have to do is call me and I’ll have it sorted out in a jiffy I assure you…\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"booze","excerpt":"So we have more outrage on the news at the levels of boozing that is going on, people are getting spannered and causing trouble in town centers the length and breadth of this fair land, children dropping dead in their thousands from cognac overdoses, old men are running riot, high on alcopop sugar rushes.","title":"Booze booze booze.","publishedAt":"2008-11-10","readingTime":"4 min read","rating":5}}},"__N_SSG":true}