{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"I’ve been feeling under the weather for a couple of days, racked with a terrible ague, struck down with a horrifying case of the pox, cursed with a vile bout of plague! Oh OK, I was feeling a bit ill, probably a slight  cold or something, maybe the dreaded man flu… who knows.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Alas I was struck down with this ailment on Sunday and I was unsure if the local apothecary was open to sell me a trepanning kit to relieve the pressure that my brain was suffering under. Casting aside the idea of physical intervention, I thought I might at least crawl down to my local supermarket and buy something healthy to boost my fruit intake in an effort to help the poor ailing body out.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Ignoring the actual fruit section, far too tired to chew, I sallied forth to the juice section. I’m presented by the usual enraging selection of stupid fruit juices. There is the normal orange, apple and grapefruit type drinks which are all fine and tasty. Then there is the smoothie selection, mango and passion fruit, strawberry and banana and so on, again pretty tasty, but getting to a cost level that makes them somewhat preposterous. Then we get to the section that truly invokes a rage, the superfruit drinks!\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Drink that are so super, so wonderful, so amazing and so expensive that sipping no more than a cap full will surely imbibe you with an ever lasting youth. Ram packed with antioxidants, omega 3s, vitamins, minerals, fibers and all manner of other things, making these super juices akin to a modern day ambrosia. Hurray for super fruits, hurray for Açaís, hurray for Mangosteens, hurray for Wolfberries, hurray for Pomegranates!!\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Only they’re not really that super at all, they are no better than most of the other juices in the section. They just have stupid names and people have never heard of them so they think they are better and thus will willingly to pay several bushels of gold just the pleasure of obtaining a small bottle of this crap.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"That’s all quite annoying but I’ve gotten used to looking at this expensive cartons with disgust as I grab some good old orange juice (just as good for you, but too common to be cool it seems) so it barely raises more than a minor ire these days.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"However in the Waitrose where I like to obtain my weekly nutrients, they do an odd thing, right next to the fruit juice section they have shoved the chilled wine section, and next to that is the free wine tasting section. In my state I would normally have sidled past on the way to get some fizzy water to go with the juice to stave off death a while longer, however something attracted my attention.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The woman looking after the stand asked me if I wanted to taste some superfruit wine!!! Yes you can now buy bloody pomegranate wine, apparently it’s very good for you, packed with antioxidants and full of nutrients. Now I thought we, as a nation, were in the grip of booze based destruction but no, the answer is this stuff apparently. It’s better for you than almost everything on earth and will turn us into a nation of super workers, or something like that.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"At this point I had stopped paying attention to the health tips she was imparting, and was paying a more immediate attention to the vile taste that was encompassing my mouth. I realise desert wines (which this was supposed to be an example of) are sweet and a bit different from normal wine, but they can be lovely. However this stuff was disgusting, repugnant and truly abhorrent. I would rather have been eating a vat of elephant spleens lightly pan fried in battery acid than drink a bottle of this stuff. I don’t care if it’s good for me, it’s fucking horrible.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I looked about for the spittoon but sadly one was not present, I briefly pondered spitting the mouthful of satanic flavouring into her face as a lesson not to trick the sick with her evil elixirs in the future, but in the end I thought better of it.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The ultimate insult of course was the £14.99 they wanted for half a litre of this offensive substance. Super fruit my arse…\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"fruit","excerpt":"I’ve been feeling under the weather for a couple of days, racked with a terrible ague, struck down with a horrifying case of the pox, cursed with a vile bout of plague! Oh OK, I was feeling a bit ill, probably a slight  cold or something, maybe the dreaded man flu… who knows.","title":"Super Fruit.","publishedAt":"2008-11-24","readingTime":"4 min read","rating":3}}},"__N_SSG":true}