{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Whilst in Washington of late I noticed some things, it was hot and it was spacious. The spaciousness was filled with many things, monuments, government buildings and, joy of joys, countless charity folk.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I had pleasant encounters with the ACLU trying to gain support for marriage equality who quite understood that I would rather donate to things here and wished me a nice flight.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"There was a moron from the Conservative Voters Association (or something) whose opening gambit was so stupidly leading it invited disdain.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“Do you support green energy?”\\n“No”\\n“…”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"There was Greenpeace man:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“Hello have you thought about the environment”\\n“Well yes but there is no point talking to you really, I don’t live here”\\n“It’s ok, I work for Greenpeace and we operate all over the country”\\n“No I mean, as you can tell from my preposterous accent, I’m not from this country”\\n“Oh that’s ok Greenpeace is a global operation”\\n“Yes I know that, I’m not stupid, I know who Greenpeace are but I’m still not contributing here, it would be financially imprudent due to tax reasons for one thing.”\\n“They do very good work”\\n“I don’t care, I’m not giving you any money”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"He warbles on a bit whilst I scan the area for a suitable place to sell me some turps and a sandwich then I leave perplexed as to why he was still talking.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"These encounters ranged from simply time consuming to pretty annoying but nothing compared to what was to come.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I was strolling around downtown when I spied a stall with some gents, looks like they are some pals of Obama for I see a large poster of Herr Obama. As I get closer something seems amiss, I don’t recall him having a moustache.  Wait that’s not just any moustache, that’s a Hitler moustache. Wait wait, that’s another poster with a nice composite of Obama and Hitler surveying some nice SS troops or something. What the blazes?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I try to take a picture of said poster, so incredulous am I that it’s real, but this involved getting closer, what a mistake. One of the chaps manning the stall sees me close by and tried to speak with me before I can get a shot.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“Do you have a few moments?”\\n“No not really, that’s just too offensive”\\n“You’re right Obama’s financial plans are offensive!”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Whilst this might be a witty retort, it still does not really make me wish to continue to converse.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“Err no, likening any politician, in a roughly democratic country, to Hitler is offensive and mostly undermines anything you have to say really”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I walk off uninterested with what he has to say next. As I stroll away some kindly chaps sitting in a nearby cafe suggest I might like to punch him in the face, that’s quite tempting I reply but alas a fist fight does not ensue, for shame.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"hope-and-chjarity","excerpt":"Whilst in Washington of late I noticed some things, it was hot and it was spacious. The spaciousness was filled with many things, monuments, government buildings and, joy of joys, countless charity folk.","title":"Hope and Charity","publishedAt":"2009-07-03","readingTime":"3 min read","rating":4}}},"__N_SSG":true}