{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsxs(\"blockquote\", {\n      children: [_jsx(\"p\", {\n        children: \" Only two days ago I was searching for trips to Egypt over New Year. XL came up on the search and I could have booked with them only yesterday. It is shocking that with this imminent collapse the company was still happy to take people’s money when they knew what was going to happen.There should be rules to prevent this sort of behaviour.\"\n      }), \"\\n\", _jsx(\"p\", {\n        children: \" Michelle, London \"\n      })]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Right, so you want rules to stop companies trading when they know they are about to go bust do you.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Fine so we’ll make a rule, just cause you asked nicely Michelle. Oh hang on what’s this, another company took an order from you 5 seconds before falling foul of this new rule.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"This is an outrage!!! WE CAN NEVER LET THIS HAPPEN AGAIN!!! Lets instigate a new new rule that stops companies from taking money when they are about to fall foul of the new rule that stops them taking money when they are about to go insolvent.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Oh no wait, you’re just a blistering dunderhead who has no idea about anything so I think on this occasion we’ll just go ahead and ignore you if it’s all the same. There are rules about this sort of thing, it’s call bankruptcy you moran. Oh how I wish you had booked with XL, I really do, just so I could imagine the stupid tears welling up in your probably hideous eyes at the news that there would be no holiday for you this year.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I really should stop reading Have Your Say…\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"never-again","excerpt":"Only two days ago I was searching for trips to Egypt over New Year. XL came up on the search and I could have booked with them only yesterday. It is shocking that with this imminent collapse the company was still happy to take people’s money when they knew what was going to happen.There should be rules to prevent this sort of behaviour.","title":"We can never let this happen again!","publishedAt":"2008-09-13","readingTime":"2 min read","rating":1}}},"__N_SSG":true}