{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"What an interesting news day, a rage inducing news day. You might imagine that the downfall of the global markets might be a cause of spot anger. Not here, no today’s rage was induced by 73 people who apparently have just about enough brain power to use a phone.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"42 people phoned Ofcom to whine about G. Ramsey killing, then eating the fresh heart of, a puffin. Whilst it might have been unpleasant to taste, quite why it was offensive I don’t know. That was quite anger inducing that 42 people are so bored and worried about puffin rights that they bother to waste their time and money in calling Ofcom (oh how I would love to man those phones for just one day and be allowed to respond as I felt fit to the people who bother to call in).\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"However not really, what’s worse it the other 31 people who make up this 73.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You see, 31 people moaned that the BBC News report showing footage of a Palestinian man ramming buses and cars with a bulldozer, killing three people and then the man being shot dead in the cab of the vehicle by an off-duty Israeli soldier. Now I might agree with these whiners that this is not really news and maybe best not shown on screen… but FOURTY BLOODY TWO people moaning about a puffin heart compared to only 31 about 4 people being violently killed on screen. What the heavens is wrong with people’s sense of perspective. It’s a bloody puffin for fucks sake, yes they are kind of cute but they are everywhere in Iceland and one or two are not going to be missed, for the love of Thor get a grip. Next you’ll be claiming that dog stew is cruel or something.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Wankers.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"numbers","excerpt":"What an interesting news day, a rage inducing news day. You might imagine that the downfall of the global markets might be a cause of spot anger. Not here, no today’s rage was induced by 73 people who apparently have just about enough brain power to use a phone.","title":"Numbers numbers","publishedAt":"2008-09-11","readingTime":"2 min read","rating":5}}},"__N_SSG":true}