{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Casting my mide back to the days of yore (just before the Jacobean era I believe, it was all green fields and rolling hills at the very least) I remember fondly going shopping as a youth to some ghastly supermarché or other (before Carrefore seemed to disappear from British shores). During such shopping sprees items would be purchased, amongst which would be washing powder, that would come in bloody huge weighty boxes. Boxes which I quickly learnt from scanning the active compounds contained about 10% cationic and non-ionic surfactants, that’s soap to you and me, the rest consisted of this and that, whiteners, water balancers and so on but a whopping 50% ish was pure filler. Nothing a all to do with washing, just their to make the box look big and the value better. What a scam, I was lugging bazillions of kilo’s of nothing about, and paying (well a parent was paying, but that’s my inheritance they were squandering) for the displeasure of back ache. I felt bitter, cheated and enraged.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Fly forward some time (I believe the spinning jenny and the stove pipe hat came and went in this intervening period) and I’m lying in bed being roused from my slumber by the radio blaring into my ear, upon which there are adverts (down with the BBC and their ad-brakeless information!). What do I hear, WHAT? I hear that Persil small and mighty now comes in a SUPER concentrated form, which is good as you can do more washes for the same amount of goo AND AND AND there is less packaging so it’s kinder to the environment!!!! YAY, WE ALL WIN.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Only we don’t as we’ve all been duped, like fools. For, no doubt, if I were to once again scan the list of active components in this “new” wonder product I would find something indicating that all that’s changed is a reduction in the nothing that’s adding to the bloody product. If they cared so much about the fucking environment why have they spent the last 400 years making massive packets for no reason at all. I’ll tell you why, it’s cause they hate the environment and they hate us, the customers, why else would they treat us like simpering imbeciles, one day dazzling us with BIGGER BETTER MORE the next with SMALLER SUPERER MORE for the same damn product.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"God I hate the myself and the nation for pandering to these bloody ad campaigns, I’m so annoyed I’m off for a double skinny mocha chocha latte at Starbucks on my Vespa, now where did I put those Gucci shoes I wanted to wear, I need to look cool… GAAAA\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"One Response to Size does matter.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Comrade Von Lichtenstein says:\\nOctober 16, 2008 at 9:22 am\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Even Gucci shoes couldn’t make you look cool, comrade… 😉 The only way you could look cool would be to be sitting in a pub, playing cards, drinking smuggled in red bull and eating a $5 steak. Now THATS the height of coolness.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"size-matters","excerpt":"Casting my mide back to the days of yore (just before the Jacobean era I believe, it was all green fields and rolling hills at the very least) I remember fondly going shopping as a youth to some ghastly supermarché or other (before Carrefore seemed to disappear from British shores). During such shopping sprees items would be purchased, amongst which would be washing powder, that would come in bloody huge weighty boxes. Boxes which I quickly learnt from scanning the active compounds contained about 10% cationic and non-ionic surfactants, that’s soap to you and me, the rest consisted of this and that, whiteners, water balancers and so on but a whopping 50% ish was pure filler. Nothing a all to do with washing, just their to make the box look big and the value better. What a scam, I was lugging bazillions of kilo’s of nothing about, and paying (well a parent was paying, but that’s my inheritance they were squandering) for the displeasure of back ache. I felt bitter, cheated and enraged.","title":"Size does matter.","publishedAt":"2008-10-09","readingTime":"4 min read","rating":3}}},"__N_SSG":true}