{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Oh how fun, waking up at 5 am in need of the toilet, pondering if this is a sign of the old age that looms close round the corner. Get up, use toilet, go back to bed flip light switch back off ALARM ALARM ALARM. Wow that’s odd why have a fire alarm switch next to the bed. Oh no wait that is just a fire alarm DAMNIT I have to get up. Stumble out wait wait wait, oh this is a not a drill. 3.5 hours later, one HCL acid spill later I am very tired, and cross.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Not that it’s anyone’s fault (I’m pretty sure, having checked my face, that Fraser and I did not get horribly drunk and have a post pub acid fight) but oh my how annoying.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Also the hotel keys made me furious, wasteful plastic disposable keys, one use only. Do you hate the earth Thistle hotels, DO YOU.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I fear the rage level today will be horrible exasabated by exhaustion… For shame.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"acid","excerpt":"Oh how fun, waking up at 5 am in need of the toilet, pondering if this is a sign of the old age that looms close round the corner. Get up, use toilet, go back to bed flip light switch back off ALARM ALARM ALARM. Wow that’s odd why have a fire alarm switch next to the bed. Oh no wait that is just a fire alarm DAMNIT I have to get up. Stumble out wait wait wait, oh this is a not a drill. 3.5 hours later, one HCL acid spill later I am very tired, and cross.","title":"Acid attack","publishedAt":"2008-09-19","readingTime":"2 min read","rating":1}}},"__N_SSG":true}