{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"I am sure everyone knows the story about the little train going about it’s daily business. It goes something like – \\\"A little black train goes down the track. clickety clack, clickety clack.\\\" (alas Amazon \\\"look inside\\\" prevents me from stealing more of this copyrighted material)\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"What a pleasing tale it is too, a nice little train making a nice little noise as it zooms about it’s track. I’ve been on trains and almost drifted off to sleep, mesmerised by the rhythmic noise that the wheels on track make. Hell, I’ve probably thought I was listening to my iPod on more than one occasion thinking \\\"man these are some awesome minimal tech tunes\\\" only to find myself headphone less and deluded by the \\\"tunes\\\".\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"However, this pleasantness is in NO WAY matched by some twunt on the tube clicking a bloody pen on and off, on and off, for half the length of the flaming central line. Click click click click. He was not even deep in thought doing a crossword, click, or heavens forbid sudoku, mainly, click, I imagine, click, cause he lacked the brain required to-do thought. Click click click.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Every station that passes the rage increases, click click click, but it’s one of the situations in life that present a problem. Click.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I could have yelled across the train to stop doing that, click, I could have wrestled the pen from his puny grasp and rammed it into his eye, click, I could have just beaten him to death with a London Lite, click click. However all of these actions would have lead to me being the annoying rage inducing freak on the train which just won’t do, click. Hamstrung by social acceptance all that’s left in the arsenal of the average commuter is the stern glare. Click click.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"This was not enough however, oh no. Click.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"clickety","excerpt":"I am sure everyone knows the story about the little train going about it’s daily business. It goes something like – \"A little black train goes down the track. clickety clack, clickety clack.\" (alas Amazon \"look inside\" prevents me from stealing more of this copyrighted material)","title":"Clickety clack, clickety clack.","publishedAt":"2008-09-24","readingTime":"2 min read","rating":4}}},"__N_SSG":true}