{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"There are several things you don’t want to experience whilst staggering about Ealingtown catastrophically hung over from the previous night’s Gin bender. One of those is being asked to spare 5 minutes for charity, luckily this was not a problem today. Another thing you don’t want it a flaming racket being blared into both ears, especially when each ear is recieveing it’s own different din.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"To the left we have bloody Hare Krishnas playing some god awful drum thing, tapping finger cymbals and wailing as they traipse though town, for what purpose I don’t know. They are quite annoying but you can imagine that if they ever got out of hand and induced an incandescent rage they could easily be dealt with by just beating them to death with the banner they like to carry about. Alone this would not have been too much of a rage issue.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Alas in addition to this, the right ear was being assaulted by another audio atrocity, Socialist Worker Man! As a rule he’s an annoying breed at the best of time, yelling on and on about stuff you just can’t quite care about whilst you throw you life away buying crap you probably don’t really need, but today things were far, far, worse. On and on he droned about some theft or other, rich stealing from the poor, banks crushing your soul and so on, all loudly. Very loudly, as it seems he’d saved up and bought himself a bloody electronic speaking-trumpet, where he got the money from I’m not sure, a) money is theft and b) the rich man has stolen it all, apparently.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"My head throbs further.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Alright, probably, he’s got a point to some degree, The Man is a bit of a fucker at times, but the problem is how he went about letting everyone know. His actions were so enraging that they actively encouraged me, as i meandered towards the station, to dream of a police state being set up, where this sort of protest would result in an immediate arrest and a swift trip down a flight of metal stairs at the local nick. In this dream state there would be no more headache exacerbating rackets on Saturday mornings, just the happy sound of baton on protester, muffled behind a station wall to a pleasant manageable volume level, joy.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"clowns-and-jokers","excerpt":"There are several things you don’t want to experience whilst staggering about Ealingtown catastrophically hung over from the previous night’s Gin bender. One of those is being asked to spare 5 minutes for charity, luckily this was not a problem today. Another thing you don’t want it a flaming racket being blared into both ears, especially when each ear is recieveing it’s own different din.","title":"Clowns to the left of me, jokers to the right.","publishedAt":"2008-09-27","readingTime":"3 min read","rating":2}}},"__N_SSG":true}