{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"One, youth, learn to damn well speak or at least if you must talk before gaining the basic skills in communication at least don’t speak loudly on buses into your stupid mobile phones about absolute crap. Also punctuation does not need to be spoken aloud and “yeah” is not a bloody punctuation mark even if, whilst I slept in today, the rules of spoken punctuation have suddenly changed. Also sitting on a bus talking about the best way to “do” a girl is somewhat less than ideal.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“So yeah, if you want to get at a girl yeah best to go for the face yeah makes them remember yeah forever yeah like these girls yeah had shanks yeah like long ones yeah they cut her up yeah like they were norf London yeah…” blah blah blah. DEAR GOD GIRL SHUT THE HELL UP or at least learn to bloody well articulate a little bit.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Two, Croc shoes on grown adults are clearly wrong, that’s plain for all right thinking folk to see. Crocs with socks, no no and triple no. Stop it, it’s fashion trends gone crazy I tells you. Infuriating!\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"crocs-and-socks","excerpt":"One, youth, learn to damn well speak or at least if you must talk before gaining the basic skills in communication at least don’t speak loudly on buses into your stupid mobile phones about absolute crap. Also punctuation does not need to be spoken aloud and “yeah” is not a bloody punctuation mark even if, whilst I slept in today, the rules of spoken punctuation have suddenly changed. Also sitting on a bus talking about the best way to “do” a girl is somewhat less than ideal.","title":"Crocs and socks, yeah.","publishedAt":"2008-09-21","readingTime":"2 min read","rating":2}}},"__N_SSG":true}