{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Locks, as we know have been around for at least 6000 odd years, that’s 6000 years in which knowledge of their usefulness and operation could filter down in to the mental consciousness of all but the simplest morons. Knowing this fact its quite a surprise that my upstairs neighbour seems totally unable to use the fucking things. Every single day I used to come home to find the front (1) door wide open to the world, I would proceed to front (2) door to find, yes you guessed it WIDE BLOODY OPEN. Now I confess that both had odd locks, one was a pain to shut and one you had to get out your key and explicitly lock it (no Yale lock here, oh no).\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Fast forward some months and the landlords had obviously noted that someone living in the block was a dim-witted goon and so they attached self closing door spring things, mended front (1) door so it shut easily and added an extra lock self closing lock on the front (2) door. Did this help? Did it my posterior, She still manages to conspire to leave the door open, she must actually be putting effort in now I’m convinced. Even when it is shut she still can’t be arsed to lock the one lock that might stand a chance as retarding a burglar progress whilst breaking in by more than 5 seconds.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I’ve half a mind to break into her flat in the middle of the night and savagely beat to within an inch of her life then steal all her belongings to ensure she understands that locked doors are on the whole a good thing.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"lock","excerpt":"Locks, as we know have been around for at least 6000 odd years, that’s 6000 years in which knowledge of their usefulness and operation could filter down in to the mental consciousness of all but the simplest morons. Knowing this fact its quite a surprise that my upstairs neighbour seems totally unable to use the fucking things. Every single day I used to come home to find the front (1) door wide open to the world, I would proceed to front (2) door to find, yes you guessed it WIDE BLOODY OPEN. Now I confess that both had odd locks, one was a pain to shut and one you had to get out your key and explicitly lock it (no Yale lock here, oh no).","title":"Lock the damn thing.","publishedAt":"2008-09-23","readingTime":"3 min read","rating":4}}},"__N_SSG":true}