{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"As I wend my way home from another day at the grind stone I tire as the wind works against me. I dodge and weave the morons who seem determined to hurl themselves under me wheels but finally make it to my road unscathed. I swing into the little lane that leads to my first front door. As usual of late it’s full of crap: a skip, sacks of building rubble, bricks and so on.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Wait! What’s this, there something new! There appears to be an old man standing there looking suspicious. He’s looking suspicious because he’s having a flaming piss.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"He spots me and stops what he’s doing and looks guilty and blurts out:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“I’m sorry, I couldn’t wait. It’s because I’m old…”\\n“Umm… Yeah ok, whatever”\\n“I’m old, I could not hold it”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"He claims whilst gesticulating wildly.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It’s swiftly apparent, however, that it’s not really his age that’s the problem, it seems more likely that it has something to do with being hammered drunk at 6:07 on a Tuesday evening.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Sadly for him, his slight, drunken, embarrassment was about to increase as a neighbor also appears behind me. He spots her and realises that hanging about making further excuses is probably not the correct course of action.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“I better leave”\\n“Yes I think you should”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"He then staggers past us and the skip to be joined in the street by someone who seems to be an acquaintance. The wander off shouting talking loudly to each other\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now don’t get me wrong, I’m sure I’ve used a dark ally late at night before to relieve ones self, but 6:07 on a bright sunny evening! No and no old man!\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The only saving grace was he was using the fence and not the front door.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"old","excerpt":"As I wend my way home from another day at the grind stone I tire as the wind works against me. I dodge and weave the morons who seem determined to hurl themselves under me wheels but finally make it to my road unscathed. I swing into the little lane that leads to my first front door. As usual of late it’s full of crap: a skip, sacks of building rubble, bricks and so on.","title":"But, but, I’m Old!","publishedAt":"2009-04-07","readingTime":"2 min read","rating":4}}},"__N_SSG":true}