{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Not only are there no busses (apart from the 83, more on that in a bit) this morning due to some strike or other, I have to witness the curious act of the council fixing brackets and hanging baskets of flowers from my local street lights… Now call me seasonally naïve but isn’t spring or summer not better the time to do this. Surely this catastrophic waste of money will result in pots of dead flowers in a few weeks and a sense that the whole place is a festering craphole (silence Andy) so bad that that they can’t be bothered to take away the springs now long dead flower baskets. That and they were not even very nice ones, too much green not enough flower.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If this was not enough, I also had to deal with Crazy Woman, “There are no busses today” “you might get the 83, they are running that for the kids” “There are no busses at all, apart from the 83”, “I don’t know your waiting here, there are no busses, look read the sign, other than the 83 maybe” and on and on. I KNOW THERE ARE NO BUSSES YOU HIDIOUS FACED DRUNKEN HAG, I CAN READ, THE ONLY REASON I HAVE BEEN HERE SO LONG IS YOU HAVE BEEN TALKING AT ME FOR 5 MINUTES ABOUT THE BLOODY 83 BUS. Is not what I said, I kindly thanked her for the reassuring words about the 83 and walked off slightly annoyed that I had decided not to cycle today after all (as an aside she was also factually incorrect, the E11 was also running, for the kids apparently, stupid witch).\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"salubrious","excerpt":"Not only are there no busses (apart from the 83, more on that in a bit) this morning due to some strike or other, I have to witness the curious act of the council fixing brackets and hanging baskets of flowers from my local street lights… Now call me seasonally naïve but isn’t spring or summer not better the time to do this. Surely this catastrophic waste of money will result in pots of dead flowers in a few weeks and a sense that the whole place is a festering craphole (silence Andy) so bad that that they can’t be bothered to take away the springs now long dead flower baskets. That and they were not even very nice ones, too much green not enough flower.","title":"Salubrious West Ealing in bloom","publishedAt":"2008-09-12","readingTime":"3 min read","rating":3}}},"__N_SSG":true}