{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"The tube has been causing much angst in the last two days. Firstly, yesterday I had to suffer the audio atrocity that was a busker at Notting Hill station. Now, as you might imagine, I’m not a fan of buskers at the best of times, they all fall in to two camps, the awful and the very awful. OK, that’s a lie, some of them do have a talent, it’s just a talent I never want to hear whilst whisking myself about Londontown on public transport. This is a fact that will remain true until the day I catch some underground minimal tech house Djing action, a day I never expect to see.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"There is a base level of annoyance at any busker, so imagine my shock and horror when I alighted the carriage I was occupying to be confronted by a noise so awful, so displeasing, that I’m immediately tempted to shatter my eardrums with a rolled up London Lite. Yes you guessed it, some bastard was playing the bloody bagpipes. This is an instrument designed to strike fear into the hearts of a foe on the battle field, an instrument so ghaustly that no one on earth can find pleasing to listen to. So why, you might wonder, was he not turfed out of the station by some burly guards for disturbing the peace forthwith and possible given a shoeing for good measure?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well it seems that not only was he there by permission as an official busker, but I also happen to know, like all of the tube’s buskers, he’d passed an audition to get a licence to be there. Someone actually heard that racket and decided that it would be fun to inflict it on everyone else? I can only imagine that the rowdy piper got his license by threatening to stove in the head of the people conducting the audition with his fascist, jackboot clad, feet if they turned him down. It’s the only explanation…\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The next moment of irritation came after a wonderfully ecstatic trip to Westfield, Europe’s largest inner-city shopping centre, a trip where nothing at all annoyed me. The masses of people blundering about getting in my way, the stupid layout of shops, having items in display that you couldn’t actually buy was all brushed aside, such was the warmth of the capitalist glow that was enveloping me.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"However, on leaving this Mecca of commercialism I wended my way to Sheppards Bush station, a station that was rebuilt not more than 2 months ago, what was I confronted by? I was confronted by 3 in ticket gates, 5 out ones, a mass brawl of people trying to get in, and NO ONE AT ALL trying to get out. Quite why the tube chap who stood there bellowing like a dullard for people not to push didn’t just engage his bloody brain for a second and swap a few of the out barriers to in ones I don’t know.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"More to the point, why did the flaming antipodean galahs that built the bloody thing not think that perhaps the new station might be a bit more popular than it used to be, what with a fucking huge shopping centre they stuck next door, and thus might need slightly more ticket gates.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The whole sorry situation was only made more infuriating by the morons ahead of me in the queue getting an oyster FAIL notice and rather than seeing assistance as advice (although I realise from experience this can be very tiresome), decided to repeatedly jab their ticket on the reader holding me up for even longer. Bastards.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"tube","excerpt":"The tube has been causing much angst in the last two days. Firstly, yesterday I had to suffer the audio atrocity that was a busker at Notting Hill station. Now, as you might imagine, I’m not a fan of buskers at the best of times, they all fall in to two camps, the awful and the very awful. OK, that’s a lie, some of them do have a talent, it’s just a talent I never want to hear whilst whisking myself about Londontown on public transport. This is a fact that will remain true until the day I catch some underground minimal tech house Djing action, a day I never expect to see.","title":"Tube woe.","publishedAt":"2008-11-15","readingTime":"4 min read","rating":3}}},"__N_SSG":true}