{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"My body, my brain and I have been at loggerheads of late, I try to mediate between the two but there is no joy it seems. They are determined to stitch each other up at every available opportunity.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"All week they have been squabbling over what time to sleep, the brain wants to stay up Monday night to watch election fever reaching a head, the body wants to collapse into a slumber after a long day at the coal face. Tuesday evening both were quite adamant that after getting home very late from work snoozing might be a good idea, hurray agreement.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But what’s this, 4:50 am that sneaky fucker body decides now would be the perfect time to play a trick on the brain and wake us all up, why I don’t know. We lie there for a minute or two pondering whether the world’s ended with the election of Palin (I always assumed that if McCain won he would die of a heart attack from celebrating too much/been shot by Palin in a terrible hunting “accident”). So we get a moments agreement between mind and body allowing the arm to flip the radio on.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"This happens just in time to hear Obama’s rather good acceptance speech thingy in Chicago. Maybe the body is not so spiteful after all, maybe it felt a disturbance in the force and thought the brain might like to hear this, it was after all very good to hear.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It’s over, great we can get back to sleep for another 2 hours, wake up and get to work pretty refreshed to make the site I’ve been slaving over live. Only no, now the mind is pissing about thinking about work. What the fuck am I to do here, can’t we just work together, we’re on the same team people, sleep damn it. No fine, in that case we’re getting up, HA take that mind, take that body, I’ve called your bluff!!\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So we get to work at 7:30, pretty quickly however we all realise that this petty squabble has gone horribly wrong, we’ve turned into a jibbering wreck, luckily though a swiftly purchased bacon roll helps us hold it together long enough to get the changes done in time. Yay. we can leave early to get some sleep.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"However what’s this, the brain has other ideas, it decides that going to bed at 7 and getting a nice 13 hours sleep is not the ticket, no, it hatches a plan to trick the body into visiting the local tavern and imbibing a few pints of fermented apple juice.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"At this stage the body is very wary, it knows the past, it knows what’s happened before, it remembers the long nights of abuse it’s endured at the hands of the brain in the company of various reprobates and vagabonds. Sadly it’s powerless to resist, after getting up so early it has expending all it’s defensive energy some hours previously. As you can imagine it all goes horribly wrong and there is another night with about 90% too little sleep. I even had the forethought to turn off the alarm to try and get the extra kippage needed.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Pointless.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Body wakes us up as usual at the normal hour in a further escalation of this timeless battle, another day of feeling exhausted and angry ensues.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"One day I will get a peace accord between the two and we can all get along nicely, no more lying awake filled with rabid anger at not sleeping, no more rage inducing hangovers. Till then drunken insomniatic apoplexy will continue I fear.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"war","excerpt":"My body, my brain and I have been at loggerheads of late, I try to mediate between the two but there is no joy it seems. They are determined to stitch each other up at every available opportunity.","title":"We are at war people, WAR I say!!","publishedAt":"2008-11-07","readingTime":"4 min read","rating":3}}},"__N_SSG":true}