{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Firstly when going to work I like to be able to leave my house, I say like, I mean have to in order to get paid. Trouble is some obnoxious Toyota hilux (huge wanky pickup truck thing) owning oik keeps parking in my little side road making it almost impossible to get past. This problem is only exacerbated by a) me having a bike b) it being bin day meaning sacks of crap are heaped up on what path is left. What do I get when I struggle past, lip from said oik from the top of his building project to mind out. MIND OUT, if you have not parked your fucking car here I would not need to mind out. Heaven forbid if I had a pram with me.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It’s not even like this is a one off, living, as I do by a taxi office the roads and pavements are always clogged up with people sleeping, washing cars, annoying the fuck out of me by trying to engage in a conversation whilst waiting for the next fair to stagger into the office. Each and every time you try and get past they glare at you for daring to touch their precious heap of crap they call a taxi. Tell you what champ, I’ll stop touching your car when you stop using it to block the fucking pavement. Till then you can fuck right off, I’ll key the thing if I so desire (not really, I’m not risking damaging my key on that tat).\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Also what I don’t want it some cyclist stopping dead in the road right in front of me almost causing me to crash, for seemingly no reason at all. Although that was tinged with happiness as she then proceeded to plummet sideways to the ground in a heap.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"work","excerpt":"Firstly when going to work I like to be able to leave my house, I say like, I mean have to in order to get paid. Trouble is some obnoxious Toyota hilux (huge wanky pickup truck thing) owning oik keeps parking in my little side road making it almost impossible to get past.","title":"I knew going to work was a bad idea.","publishedAt":"2008-10-07","readingTime":"2 min read","rating":4}}},"__N_SSG":true}