{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"I got a Christmas card at the weekend, a full 39 days before the true horror of Christmas should really begin. I find this a little early to be honest, that said I would find any card that gets here before the 24th early and thus thoroughly unwanted, unlike cards that come on the 24th that are just plain unwanted.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If this were from some slightly amnesiac friend who somehow forgot that I loathe Christmas, I might just pop it straight in the bin and think no more about it. However it was not from such a friend, no, it was from someone far, far worse. It was a piece of marketing bumph! Marketing bumph that I clearly don’t need and don’t want.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"What’s it selling you might wonder, what would warrant such an invasion of my letter box, a cure for smallpox maybe, the secrets of the lottery, tickets for a luxury cruise around scenic Bhutan, well no, in fact it’s not really selling anything at all. You see the bloody thing was from the Royal Mail informing me that I should get my post in early to ensure that the cards I won’t be sending get there intended recipients on time.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now this is fairly annoying, I find unsolicited post enraging at the best of times, however this had taken a special place in my rage filled heart. The reason you see is simple, on the back of this vile seasonal missive was a small little sign, a sign that was informing me that I should “recycle now”. Adding that, “when you have finished with this letter please recycle it”.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now call me odd but is it not a little rude to tell me what I should be doing with the crap that you send me, crap that I did not ask for. If I wish to burn it for no reason at all, I will, if I want to turn it into priceless art, I will, well I would if I had talent in such areas, but I digress, if I want to compost it and use it to fertilise a crop of heroine to sell to children, I will.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If you cared so much about saving the planet and thus wanted me to recycle the thing, maybe, just maybe you should just not print the fucking thing in the first place. I imagine that would be infinitely more friendly to the planet and it would definitely be more friendly to Christmas loathing individuals such as myself.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Somewhat luckily there is an address to return this junk to if it’s undelivered, so I’ll be posting it straight back. That’ll learn them!\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"christmas-2","excerpt":"I got a Christmas card at the weekend, a full 39 days before the true horror of Christmas should really begin. I find this a little early to be honest, that said I would find any card that gets here before the 24th early and thus thoroughly unwanted, unlike cards that come on the 24th that are just plain unwanted.","title":"Down with Christmas – Part 2","publishedAt":"2008-11-17","readingTime":"3 min read","rating":4}}},"__N_SSG":true}