{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"So I was in delightful Bristoltown at the weekend to take in a boat trip, spy some balloon and imbibe some local booze in the form of cider.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"A good night was had by all and rest was forth coming after a slightly unfortunate walk home during which I realised that “things have changed, this used to be all shops, but now it’s a festering cesspool of drunken louts, how distasteful” – I fear old age might be approaching.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Anyway, the next day a light brunch was in order, so my kindly host and I wandered to a nearby café for some light refreshments, I swiped a lovely bottle of overpriced orange juice from the refrigerator and joined the queue in order to pay. Queues are generally quite boring and so a conversation ensued with sisterly companion about nothing in particular. When suddenly from nowhere an outrage occurred, my very being was verbally questioned and assaulted by a vile hag of a woman…\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Vile Hag – “Excuse me, are you from Australia?”\\nShocked and hurt Me – “Err, what, no, Bristol actually”\\nStupid Hag – “OH! Me too!! In Stoke Bishop, just down the way!!!”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Wow, you’re from Bristol? No! Surely not!! What are the chances of two people, both from Bristol, meeting in Bristol. That’s got to be a long shot surely? 1000’s to one no doubt.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Persistent Hag – “It’s just you have an Australian accent”\\nConfused me – “Hmm no I don’t, that’s a deeply offensive thing to say”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I add, somewhat jokingly whilst wondering if her ears are in some way defective.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Apologetic hag – “Oh no I didn’t mean to be rude”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"She replied quite seriously making me wonder if she’s a crackpot.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Crackpot Hag – “Just the tone of your voice is quite Australian. I’ve an aunt who lives in Australia”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"At this point I should have just rammed the glass bottle of orange juice into her stupid face in a vain attempt to end this hellish conversation once and for all. Alas I was feeling thirsty and needed the fruity contents to quench the, probably, booze relate, hankering for refreshment I was experiencing. I didn’t though; I did something much, much more stupid; I continued to engage in chit chat…\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Stupid me  -”Err that’s nice, where exactly…”\\nChatty Hag – “Sydney, near the opera house.  She’s 76, but she moves about much quicker than me mind”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I’m not surprised, you look like you don’t move much at all. If I didn’t know better I would assume you had some nasty debilitating illness that you would not dream of talking about to complete strangers…\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Ill hag – “but that’s hardly surprising, I was diagnosed with MS recently.”\\nSlightly confused as to what to say me – “Hmm oh dear sorry to hear that”\\nToo much detail hag – “They stuck a huge needle into my spine the other week, it still hurts quite a lot”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"At this point there are furtive glances shooting back and forth betwixt sister and I wondering if it might be just easier to leave and die of thirst outside in the sun than listen to more of these inane ramblings. Luckily the gods were looking kindly upon us and the chap behind the counter distracted her with a coffee order long enough to allow me to pay and scamper out before any more details of her ailments were forth coming.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Australian indeed, the fucking cheek of it. If I’d had my didgeridoo with me at the time I would have given her a sound thrashing for that suggestion.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"criminal","excerpt":"So I was in delightful Bristoltown at the weekend to take in a boat trip, spy some balloon and imbibe some local booze in the form of cider.","title":"Are you a criminal?","publishedAt":"2009-08-10","readingTime":"4 min read","rating":2}}},"__N_SSG":true}