{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Ah what a wonderful day, the sun is out the sky is blue, what could hamper such a wonderful day. Nothing at all that’s what. Well nothing other than the rage inducing people of Ealing town that is. Not all of the people obviously, there are some who stay at home, some that just pass by and some who might just be normal enough not to cause a bout of apoplexy. However there is a breed apart from these people and alas they all do the same thing, they work in shops, as sales assistance, and they like to annoy the bejesus out of people who have the audacity to put so much as a toe inside their store.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Haberdasher: \\\"Hello can I help you\\\"\\nNow irate shopper: \\\"No its OK I was just going to peruse your store using my own eyes to scan the shelves for potential purchases and seek your assistance only if I had a problem finding something I wished to buy, however now I’ll just leave straight away to learn you that I can’t be brow beaten into buying things from your haberdashery store.\\nHaderdasher: \\\"OK Bye! Please come again.\\\"\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Or words to that effect.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In this day and age of course this is quite common so fails to raise more than a light ire. However Ealing is no normal town, oh no, for Ealing has a nice cooks shop, Whisk. It’s full of nice cooking things, nice cooking things that you don’t really want to buy but are nice to look at, Moroccan tagines, avocado peelers etc. It also has two other characteristics, one, it sells microplane graters that I quite fancy buying and two, it employs in it’s service the most annoying, middle aged, ugly, hag-faced witch ever to gain employment in the service industry.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So once again I sally forth into the establishment trying to run the gauntlet in avoiding her and making a purchase, I wait outside till she’s talking to someone else, I make a dash for it, I enter, wander with some speed towards the destination of the planes, but I’m distracted by some fancy nutmeg mill and begin to peruse the wares. WHAT WAS I THINKING? I should have grabbed what I wanted and run (via the lovely looking other assistant at the till of course). I did not however, I dallied, I paused, I waited. Fatal!\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Hag-faced witch: \\\"Hello, do you need help with anything.\\\"\\nIncandescent Brian: \\\"No, just looking.\\\"\\nHag-faced witch: \\\"We have some other mills over here too\\\"\\nIncandescent Brian: \\\"I’m just looking\\\"\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Alas it’s too late, the rage has been induced, I’m forced to leave the store once again before I launch into an abusive stream of rage directed straight at this devil spawn of shop assistance where I would no doubt point out that when I said \\\"No\\\" I meant no, not \\\"yes but I’ll say no just so you can ignore my wishes and try to help me anyway\\\".\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I’ve been trying to buy one for months but she interjects every time. You might think just suck it up and buy it whilst dealing with her. I did that once buy something in there (a removable head spatula, very good for cake making) and ended up listening to her drone on for 10 minute about all sorts of crap. I think the only solution would be to buy the nice serrated chefs knife I’ve been coveting and brutally butcher her there and then, for the good of everyone you’ll understand.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"help","excerpt":"Ah what a wonderful day, the sun is out the sky is blue, what could hamper such a wonderful day. Nothing at all that’s what. Well nothing other than the rage inducing people of Ealing town that is. Not all of the people obviously, there are some who stay at home, some that just pass by and some who might just be normal enough not to cause a bout of apoplexy. However there is a breed apart from these people and alas they all do the same thing, they work in shops, as sales assistance, and they like to annoy the bejesus out of people who have the audacity to put so much as a toe inside their store.","title":"Can I help you?","publishedAt":"2008-09-20","readingTime":"4 min read","rating":1}}},"__N_SSG":true}