{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"In an effort to keep the ailing Westfield open during this credit crisis I have committed to spending as much time and money there as possible. With this in mind I hotfooted it there again yesterday to throw away some hard earned pennies on an evening of tasty Mexican food and tastier Mexican beer at Wahaca with an old friend. It was quite a pleasant venue, for about 12 seconds, until a rage was induced by the serving staff. Firstly they did that infuriating, I presume American, thing of telling me their name and job title.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“Hello I’m Philomena and I’ll be your waitress for the evening”\\n“That’s fascinating Phil, good for you on remembering your name and job title by the way, for a moment I thought you might be the head chef. I’m Brian and I’ll be the grumpy awkward customer who’s food you’ll be spitting in this evening”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Is not how the exchange went.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Anyway Philomena (clearly not her real name, you don’t think I actually paid attention do you?) then moved on to infuriating restaurant habit two, explaining how restaurants work.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“Have you been to a Wahaca before”\\n“Um no”-  but I did once buy a pita gyros from a Greek bloke in Athens so I think I can remember how a menu works thanks, I didn’t add\\n“Well let me just run through the menu, here we have starters, here is some street food, order 3 or 4 of them each and share, and these are the main dishes for the greedy and those who hate sharing!”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Which was really, really handy cause I totally missed the bloody great headings that sectioned the menu up into starters, street food and mains. Thanks Phil, had if not been for your vital intervention I might have just ordered tub of coleslaw and been left sadly wanting (although as it happened the coleslaw was very nice, just tiny).\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Get out of my face damn it.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So we pondered what we might want to order and chatted for a while until Phil wafted back in to commit my super pet hate amongst modern restaurateurs. In a bout of kindness she decided to offer us some suggestions, why don’t we go for some guacamole as a light snack whilst we ponder?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“It’s delicious and homemade”\\n“Homemade? You mean it’s not made here?”\\n“Oh yes, it’s made here”\\n“So someone lives here? This is someone’s home is it?”\\n“Well it feels like I live here with the amount of time I spend here he he, I’m thinking of having a bed put in the corner, ha ha”\\n…\\n“but there’s no bed so you don’t live here now, I mean it’s not your home yet?” is what I felt like adding but decided I was already teetering on the boundary between spit in food and rat poison in food so left it there.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"So, first things first, it’s not home made if you don’t make it at home, there’s a bloody clue in the words you are using. I can just about cope with slightly rubbish country pubs coming out with this crap, as there is a chance that even if it’s not homemade in the real sense, at least it looks like it is. However, a professional kitchen, in a brand new chain restaurant, housed in a brand new massive shopping centre, no no and triple no.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It’s not homemade in any shape or form, this is a flagrant abuse of the English language and it must be stopped at once. What wrong with saying “lovingly created guacamole”, “an epicurean delight of guacamole”, “an exquisitely handcrafted guacamole” or any manner of other vaguely possibly factual descriptors. Homemade, to me, makes it sound frankly horrible, lest we forget that most people these days seem to be useless cooks if J. Olivers exploits are anything to go by. Christ, someone out there didn’t even know what boiling water looked like (thankfully they do now, although if I were Oliver I would have learnt them about it by hurling a pan of the stuff into their face, this might be why I am not on TV)\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Anyway food was ordered, Negra Modelo was sipped, good times were had. Until that is, Phil returned to once more infuriate me with her vile presence to see if we wanted desert, we did, they were unfeasibly delicious, so delicious that they made me cross as to how tasty yet lethal the chocolate sauce was. Damn you Wahaca!\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"nice-house","excerpt":"In an effort to keep the ailing Westfield open during this credit crisis I have committed to spending as much time and money there as possible. With this in mind I hotfooted it there again yesterday to throw away some hard earned pennies on an evening of tasty Mexican food and tastier Mexican beer at Wahaca with an old friend. It was quite a pleasant venue, for about 12 seconds, until a rage was induced by the serving staff. Firstly they did that infuriating, I presume American, thing of telling me their name and job title.","title":"Wow this is a nice house.","publishedAt":"2008-11-20","readingTime":"5 min read","rating":3}}},"__N_SSG":true}