{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Once more I have been affronted, once more I have interacted with society, once more I have shown mercy in the face of stupidity, once more I have just about managed not to bludgeon someone to death with a tire iron, once more I encounter my nemesis!\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"As I was cycling home through idyllic Acton one bright and sunny day, without a care in the world I came across an oddity, a freak, a ruffian and a rogue! Not for the first time, alas, I run into who I will from now on refer to as Saint John Smedley-Smith-Smyth-Smithe, for such is the snivelling nature of this disgusting creature I imagine that’s the only name his parents could have given him, if indeed he ever had parents and wasn’t created in a lab somewhere.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Once more his opening gambit is as witty as ever: “Still wearing that fucking shirt I see”.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Sadly for him he decides to make this crass remark whilst trying to make a turn, thus leaving him stationary and open to attack. I’m in my usually light hearted mood so I decide to stop for a quick chat.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“Look, just what is your fucking problem?” is my initial retort.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Saint John S-S-S-S comes out with his usual guff about it being “Chelsea innit”, lacking the required whit to use real words it seems.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Angry cyclist: “I don’t care what it is; I take objection to you hurling abuse at me in the street”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Saint John S-S-S-S : “You’re typical Chelsea aren’t you, can’t take a joke”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Enraged Cyclist: “Screaming obscenities as a stranger across the street is not a joke it plain rude. Have you ever thought that you might shout at the wrong person one day and end up with a smack in the mouth?”, I emptily threaten.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Saint John S-S-S-S : “Don’t you have any friends that support someone other than Chelsea?”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Furious Cyclist: “Sure I’ve plenty, but, unlike you, they’re not obnoxious cunts. Have you ever thought that maybe I wear this because it’s bright yellow and I’m on a bike and want to be seen?”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Saint John S-S-S-S: “It’s nothing to do with the color… Do you even go to away games”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Apoplectic Cyclist: “What’s that got to do with it? You don’t get it do you, it’s nothing to do with Chelsea! Why, for example, is a cunt like you wearing a stupid cunty yellow jacket like that? Could it be for safety, could it be so other people can see you?” I say trying to speak down to his level so he might better grasp my message.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Unfortunately at this point I can see his putrid visage is not taking the basic idea in so I decide to leave after politely informing him once more not to shout vulgarities across the street at me in the future.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Just as I wheel round to continue my way home, a motor bike comes past, I stop to let him by, as a sensible road user should. Alas Saint John can’t help himself.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Saint John S-S-S-S: “That’s right cause an accident, typical Chelsea”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Incandescently raging cyclist: “Oh just shut up will you”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I cycle off.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"persecution","excerpt":"Once more I have been affronted, once more I have interacted with society, once more I have shown mercy in the face of stupidity, once more I have just about managed not to bludgeon someone to death with a tire iron, once more I encounter my nemesis!","title":"Will this persecution never end?","publishedAt":"2010-03-27","readingTime":"3 min read","rating":1}}},"__N_SSG":true}