{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Sometime last week I awoke from a pleasant Sunday slumber with a bout of minor back arghhh. A twinge of pain, a spasm of ache, but nothing too bad, I ignored it and hopped onto the bike and popped to work for a day of exciting graft. Later that day after 7 hours of fun filled keyboard tapping I made my way home. I rustled up a tasty dinner and sat down to watch some guff on the TV or play some game or other. Life was good, well briefly occupied with some pointless activity at least; I decided to celebrate with a yoghurt! I got up and skipped to the fridge, only I didn’t, I ended up hobbling like an old man, bent double with back knack. Ow ow ow! Bollocks, I’ve finally broken myself, so this is the future is it.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I ponder if there might be hope of a recovery and to facilitate this decide that cycling might not be the best idea under the circumstances for a while  As a result I have, since then, been a constant user of the wonderful public transport network of London town.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now I say wonderful but I mean infuriating of course, all last week I was reminded why I prefer to cycle whenever I get the chance, annoying hags here, screeching children there (at least one of which I’m convinced would have a serious ADD problem if I believed in such nonsense medical conditions*), purulent teenagers gabbling into their idiot boxes everywhere.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"All very annoying, but today a new week brought a new nadir, a low so low I felt ill. On the tube home as I was wishing I was listening to some fine filthy minimal tech house tunage but actually rueing leaving headphones at home whilst staring into space when suddenly I hear a “snick snick”.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"What the hell is that?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“snick snick”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I look around in confusion.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“snick snick”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Fellow commuters look a little perturbed, what can they see that I can’t.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“snick snick”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I wheel round and spy the source of the offending noise.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“snick snick”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Some filthy bastard is clipping their mother fucking nails on the god damn tube! It’s one thing, albeit quite an annoying thing, to perform personal grooming, such as applying makeup or a quick brush of the hair on the tube. For these things don’t usually result in ex-body parts being fired across a crowded carriage at potential eye removing speed.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“snick snick”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Nail clipping however is quite another matter, he’s not even being that careful about where his detritus is shoting. Anyone could eb rendered blind at any moment, or at least visiably sickened.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“snick snick”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I glare at the vile dunderhead but it’s no use, he’s focusing too much on his pudgy fingers.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“snick snick”\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I begin to wish that the train will, at any moment, jolt violently and cause him to cut his fingers off. It doesn’t, for shame. Rather the train pulls, annoyingly smoothly, into the station and he bounds off like nothing has happened leaving behind enough DNA to be fitted up for a brace of bogus police bungles without a care in the world.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Putrid swine!\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"*It’s might be real, I’ve not looked into it but it sounds made based on reading no evidence at all. Which is good enough for me.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"snick","excerpt":"Sometime last week I awoke from a pleasant Sunday slumber with a bout of minor back arghhh. A twinge of pain, a spasm of ache, but nothing too bad, I ignored it and hopped onto the bike and popped to work for a day of exciting graft. Later that day after 7 hours of fun filled keyboard tapping I made my way home. I rustled up a tasty dinner and sat down to watch some guff on the TV or play some game or other. Life was good, well briefly occupied with some pointless activity at least; I decided to celebrate with a yoghurt! I got up and skipped to the fridge, only I didn’t, I ended up hobbling like an old man, bent double with back knack. Ow ow ow! Bollocks, I’ve finally broken myself, so this is the future is it.","title":"Do you mind if I just take a crap on your face?","publishedAt":"2009-10-196","readingTime":"4 min read","rating":2}}},"__N_SSG":true}