{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Taxis, wonderful things, will scoop you up at any time of day or night and whisk you to your destination in some level of comfort.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Alas however not all taxis are equal, there are London taxis, which you can not remember falling into, drunkely muttering \\\"caaan yous take meh to ufhsjgs purleshe\\\" then waking up fresh as a daisy tucked up in bed 15 hours later. How the cabbie knew where you wanted to go is anyone's guess.  Then there are Australian cabbies who are a universal shower of hopelessness. They seem to fail at the key tennants of taxiing, that of knowing how to drive, having any idea how the city is laid out or having the faintest idea of possible traffic issues.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Its not uncommon to hop into a cab, tell your drive your intended destination, say a massive inner city train station, to be met with a question of \\\"where's that\\\". How they can get a licence without even knowing the basic points of interest of the city is amazing. Even then they all have fuckig huge satnavs sat there, why not just jab the destination into the thing and follow it...\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Even when they do know where to go they will often counter with \\\"what route do you want to take\\\" - I don't sodding know, I'm drunk and never drive about in town late at night and I've no idea where I am, it's you only job to know how to get from A to B, how about you tell me the best route by just bloody driving it.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Even then you have to listen to them mutter in to an ear piece the whole time as they all seem to be constantly on the phone to someone, who knows who. I hate to think what their phone bills are like, but maybe they should spend more on maps of the city and read them.  Will could be worse I guess, could be a tram...\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"taxi","excerpt":"Taxis, wonderful things, will scoop you up at any time of day or night and whisk you to your destination in some level of comfort.","title":"Taxis","publishedAt":"2015-05-12","readingTime":"2 min read","rating":2}}},"__N_SSG":true}