{"pageProps":{"post":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"After a fine hour or two perusing the fine fare on the aisle of my local supermarket I took my trolley, laden with goodies (and non alcoholic beer), towards the checkout in an endeavour to pay.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"There are some basic rules to picking the correct checkout at the supermarket, they are pretty obvious:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Never go for one that’s got a queue of people all with fully laden trolleys.\\nNever go for the one that’s got the old chap, he’s friendly but terribly slow.\\nNever go for the ones where the checkout urchin looks under 18, when you are buying 20 litres of fistfight cooking cider the last thing you want to do is wait for an ageing supervisor to slink over and jab the keypad to authorise your dubious life choices.\\nNever go for the queue that looks empty because there’s only one person on it, it’s a trap, always a trap.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Clearly I was still suffering from the prior evenings drain cleaner binge, for I broke this last, but most golden, rule. I sidled up to the checkout, there was hardly anything on the belt, the basket of the only person in the queue was mostly empty, this was a sure fire quick exit!\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The problem was thus, the basket was attached, not to the arm of the person, but to the front of a flaming mobility scooter. Now, I know, I know, have some patience for the elderly, fine, I will cut this seemingly pleasant old lady some slack and refrain from bludgeoning her to death with a tin of Brasso.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I stand there and watch as she very slowly, one by one, transfers things from basket to belt. Once it’s all loaded she gives the till chap a mysterious bit of paper which seems to take up several minutes of his attention, this does not look good, but wait, he’s put it to one side.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Excellent I think, we’re on the move now, might take her a while to pack but this still looks like a good choice of queue.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Wrong.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Not only is the customer suffering from a touch of infirmity and thus slowness, but the bloody teller was a complete moron. I could have trained a stoat to pack things into bags faster than this goitre was managing. I’ll be here all bloody afternoon at this rate I think.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Whilst becoming increasingly infuriated at the dunderhead’s speed or lack there of, I failed to notice something terrible happening. The old woman had started a conversation with a passing friend, this would be fine if they were on a park bench and I was not being held up, but frankly, less chat more cash please!\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The packing was finally done, the total was rung, time to pay… Umm hello… pay please… Or sit there having an inane conversation maybe?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Older OAP: Oh yes, it’s wonderful, they deliver it right to your house.\\nYounger OAP: Really Doris your such an inspiration to us all doing this for yourself!\\nTeller: Err that’ll be £29:08\\nOlder Hag: Oh it’s easy they do all the carrying really.\\nYounger Hag: That’s good, it leaves you free to get a pint on the way home ha ha ha\\nDay dreaming rageaholic: Just pay for you crap and piss off please, I have some sherry that needs drinking.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Finally she pays, after a few more minutes reminising about when this was all fields, the bags are taken away, hopefully to be filled with poison before being delivered to the home, but does she wheel her self out the bloody way, does she buggery. She just sits there in the comfort of her chair carrying on her stupid conversation with this other hag. Honestly there should be rules against this, they should insist that old people go to old man till, at least that way they would be sperareted off at their own speed.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"3 Responses to Slow coach double whammy\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Fraser says:\\nJanuary 13, 2009 at 11:19 am\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"“non alcoholic beer”? What’s wrong with you!\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"briski says:\\nJanuary 13, 2009 at 1:54 pm\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I have a very good reason for needing that non-booze booze I assure you!\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Mel says:\\nJanuary 15, 2009 at 4:05 pm\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I love catching up on your bouts of rage. The tin of Brasso made me laugh out loud in the office! :o)\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"slug":"whammy","excerpt":"After a fine hour or two perusing the fine fare on the aisle of my local supermarket I took my trolley, laden with goodies (and non alcoholic beer), towards the checkout in an endeavour to pay.","title":"Slow coach double whammy","publishedAt":"2009-01-12","readingTime":"4 min read","rating":3}}},"__N_SSG":true}